Revit 2027 API
BuiltInFailures.StairRampFailures.RampRunTooComplex Property
 Ramp Run has complex boundary and may produce unreasonable geometry. Split it into few Runs by inserting Riser Lines at the end of each Run and at the beginning of the next one. If you want to create Ramp with arc an straight section you can do it using a Run tool.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RampRunTooComplex { get; }
Public Shared ReadOnly Property RampRunTooComplex As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RampRunTooComplex {
	FailureDefinitionId^ get ();
}
static member RampRunTooComplex : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace